app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 28 Oct 2013 01:12:32 UTC +00:00], ["updated_at", Mon, 28 Oct 2013 01:12:32 UTC +00:00]]
---
    def new
	@product = Product.create(params[:product])